<template>
  <div class="english">
    <h1>Английский язык</h1>
    <p>Обучение проходит путем ознакомления с материалом раздела, закрепления изученного,
      отработки материала путём многократного повторения посредством тестовых заданий</p>
    <p>Весь изучаемый материал разбит на разделы, которые в свою очередь образуют комплексы
      соответствующие уровням международной сертификации.
    </p>
    <p>Учащийся набирает баллы по ходу прохождения раздела, выполняя успешно тестовые задания.
      Материал предоставляется порционно по накоплению определенного набора баллов, которые
      разблокируют следующий раздел.
    </p>
    <p>Баллы начисляются за успешное выполнение упражнений и тестовых заданий. За ошибки баллы
      снимаются и так до тех пор, пока учащийся не наберет необходимого количества баллов и не
      подтвердит закрепленные знания.
    </p>
    <h2>Present simple (название раздела)</h2>
    <h3>Описание правил, вводная часть</h3>
    <p>...</p>
    <h3>Дополнительные материалы</h3>
    <p>...</p>
    <h3>Примеры раздела с вариациями использования правил</h3>
    <p>Слова из раздела могут добавляться в словарь</p>
    <h3>Упражнения для самостоятельной работы</h3>
    <p>Каждое упражнение состоит из m - заданий
      Для каждого выполняемого упражнения начисляются баллы по схеме:</p>
    <p>+(N баллов) за выполненное задание</p>
    <h4>Ответы к упражнениям</h4>
    <h3>Контрольные упражнения (которые проверяет преподаватель)</h3>
    <h4>Блок с замечаниями преподавателя</h4>
    <h3>Тест на запоминание граматики</h3>
    <p>Здесь выполняется цикл запоминание-повторение для чистой граматики</p>
    <p>Это не упражнения на построение предложений, а именно повторение граматики из начала раздела</p>
  </div>
</template>

<script>

export default {
  data () {
    return {
      msg: 'Welcome to Your Vue.js App'
    }
  }
}
</script>

<style>
  /* @import "../../node_modules/katex/dist/katex.min.css" */
</style>
